{
  "navbar": {
    "home": "Home",
    "about": "About",
    "services": "Services",
    "projects": "Projects",
    "resume": "Resume"
  },
  "home": {
    "greeting": "Hi There!",
    "name": "I'M",
    "fullName": "MALEK BA ABBAD",
    "experiences": "3 Years Experience in",
    "roles": [
      "Front-End Development",
      "UI/UX Design",
      "Maintenance & Support",
      "Social Media Management"
    ]
  },
  "about": {
    "heading": "Know Who",
    "headingBold": "I'M",
    "skillsetHeading": "Professional",
    "skillsetBold": "Skillset",
    "toolsHeading": "Tools",
    "toolsBold": "I use",
    "description": "Hi, I'm Malik from Yemen. I graduated from Yarmouk University in Jordan and I'm a passionate Front-End Developer with 3 years of experience in building clean, user-friendly web interfaces.",
    "focus": "I'm specialized in HTML, CSS, and JavaScript, with a solid understanding of modern frameworks like React. My main focus is designing and building clean, responsive code to deliver smooth, high-quality user experiences across all devices.",
    "arabwdoss": "I currently work as a React Developer at ArabWare Dos, where I use my skills to build digital solutions. My experience includes developing key platforms and applications such as:",
"bank": "Creating responsive interfaces for major corporate websites, including the Bin Dowal Bank website, which focuses on providing Islamic microfinance services.",
"wallet": "Developing the Bin Dowal E-Wallet website — Yemen’s leading electronic payment gateway — using HTML, Tailwind CSS, and ReactJS.",
"baligne": "Designing modern, responsive dashboard systems like the Ballighni app dashboard, which offers a smooth workflow for employees and features real-time data fetching from APIs.",
"responsive": "I'm dedicated to delivering technical solutions that not only meet functional requirements but also ensure optimal accessibility and responsiveness across all devices."

  },
  "projects": {
    "heading": "My Recent",
    "headingBold": "Works",
    "description": "Here are a few projects I've worked on recently.",
    "balleghny": {
      "title": "Balleghny Dashboard",
      "description": "This dashboard system is a modern, responsive web application It provides an intuitive interface for handle employees tasks. The dashboard features secure authentication and real-time data fetching from APIs"
    },
    "cinema": {
      "title": "Cinema Club",
      "description": "A modern, responsive movie discovery web application that helps users explore and find movies based on different criteria. Built with vanilla JavaScript and powered by The Movie Database (TMDB) API."
    },
    "binDowal": {
      "title": "Bin Dowal Pay Wallet",
      "description": "The leading online payment gateway in Yemen – secure financial transactions anytime, anywhere."
    },
    "logistics": {
      "title": "Bin Dowal Contracting and Logistics",
      "description": "company specializes in general contracting, focusing on construction, building projects, infrastructure development, roadworks and maintenance, water solutions, and electrical engineering solutions."
    },
    "radiation": {
      "title": "Mukalla Radiation Center",
      "description": "A streamlined design that provides easy access to critical information about their radiotherapy services."
    },
    "dalil": {
      "title": "Employees Information System",
      "description": "An integrated platform for easily and efficiently searching for bank employees. Search by entering the employee's name, job title, telephone number, or even mobile number and email."
    },
    "mikrotik": {
      "title": "Mikrotik Login Page",
      "description": "Design and develop a login page for local MikroTik networks to access the internet using prepaid cards."
    },
    "bank": {
      "title": "Bin Dowal's Bank",
      "description": "Bin Dowal's Bank website offers a clean, user-friendly interface that focuses on providing access to Islamic microfinance solutions."
    },
    "arab": {
      "title": "Arab Exchange Company",
      "description": "Offers banking services compliant with Central Bank regulations."
    }
  },
  "services": {
    "heading": "What",
    "headingBold": "I offer",
    "description": "Here are a few projects I've worked on recently.",
    "webDev": {
      "title": "Web Development and Managment",
      "description": "Build responsive and user-friendly websites tailored to your business needs."
    },
    "uiux": {
      "title": "UI/UX Design",
      "description": "Design intuitive and visually appealing interfaces to enhance user engagement."
    },
    "maintenance": {
      "title": "Maintenance & Support",
      "description": "Provide ongoing maintenance and support to ensure your systems run smoothly."
    }
  },
 "home2": {
  "introduction": "HEY, I'M",
  "intro_bold": "GLAD YOU'RE HERE",
  "passion": "I'm all about front-end development and design — always experimenting, learning, and building cool things. 🎨💻",
  "fluent": "I work comfortably with modern tools like",
  "fluent_bold": "JavaScript and React JS.",
  "interest": "I enjoy creating clean, user-friendly interfaces and smooth, enjoyable web experiences.",
  "interest_ui": "clean, user-friendly interfaces",
  "interest_build": "smooth and enjoyable web experiences.",
  "designs": "Whenever I can, I bring ideas to life using",
  "designs_bold": "modern front-end libraries",
  "and": "and",
  "frameworks": " frameworks.",
  "findme": "FIND ME ON",
  "connect": "Feel free to",
  "connect_bold": "reach out",
  "with_me": "anytime!"
},

  
  "footer": {
    "developed": "Developed by Malek Ba Abbad",
    "copyright": "Copyright ©"
  },
  "common": {
    "demo": "Demo",
    "github": "GitHub"
  }
}
